In [ ]:
%load_ext sql

In [38]:
%config SqlMagic.autocommit=False
%config SqlMagic.autopandas = True
%sql postgresql://localhost/w4111
# The following connects to the class database, but it does not support Python UDFs
# %sql postgresql://student:w4111student@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
from IPython.display import HTML
import pandas as pd
pd.set_option('max_colwidth', 0)

In [39]:
%%sql
DROP TABLE IF EXISTS sailors cascade;

CREATE TABLE sailors(
    sid serial primary key,
    name text,
    rating int,
    age int    
);

INSERT INTO sailors VALUES 
(1, 'Eugene', 7, 22),
(2, 'Luis', 2, 39),
(3, 'Ken', 8, 27);

DROP TABLE IF EXISTS youngsailors cascade;
CREATE TABLE youngsailors(
    sid serial primary key,
    name text,
    rating int,
    age int    
);


DROP TABLE IF EXISTS log;
CREATE TABLE log(
  sid int NOT NULL REFERENCES Sailors,
  t timestamp NOT NULL,
  oldAge int NOT NULL,
  newAge int NOT NULL
);


drop table if exists blah;
create table blah(qty int);

 * postgresql://localhost/w4111
Done.
Done.
3 rows affected.
Done.
Done.
Done.
Done.
Done.
Done.

Empty DataFrame
Columns: []
Index: []

# UDFs

In [40]:
%%sql
CREATE EXTENSION IF NOT EXISTS plpgsql;
CREATE EXTENSION IF NOT EXISTS plpython3u;

 * postgresql://localhost/w4111
Done.
Done.

Empty DataFrame
Columns: []
Index: []

In [41]:
%%sql
DROP FUNCTION IF EXISTS pyudf1(v int);
CREATE FUNCTION pyudf1(v int) RETURNS int as $$
  import random
  return random.randint(0,100) * v;
$$ LANGUAGE plpython3u;
commit;

 * postgresql://localhost/w4111
Done.
Done.
Done.

Empty DataFrame
Columns: []
Index: []

In [44]:
%sql select name, pyudf1(age) from sailors;

 * postgresql://localhost/w4111
3 rows affected.

     name  pyudf1
0  Eugene  550
1  Luis    2340
2  Ken     2268

In [45]:
%%sql
create function google(word text) returns text as $$
  import requests;
  r = requests.get(f"https://en.wikipedia.org/wiki/Special:Search?go=Go&search={word}")
  return r.content.decode("unicode-escape")
$$ language plpython3u;
commit;

 * postgresql://localhost/w4111
Done.
Done.

Empty DataFrame
Columns: []
Index: []

In [ ]:
%sql select google('columbia university');

 * postgresql://localhost/w4111
1 rows affected.

In [48]:
rows = %sql select searchit('columbia university')

 * postgresql://localhost/w4111
1 rows affected.

In [55]:
%%sql
drop function if exists llm(word text);
create function llm(word text) returns text as $$
  import openai
  import os
  from dotenv import load_dotenv
  load_dotenv(dotenv_path="/Users/e.wu/courses/w4111.github.io/src/notebooks/.env")
  openai.api_key = os.getenv("OPENAI_API_KEY")
    
  client = openai.OpenAI()
  c = client.chat.completions.create(
    model="gpt-4o-mini",
    messages=[{"role": "system", "content": "be helpful"},
              {"role": "user", "content": f"summarize the following text in under 20 words: {word}"}
        ]
  )
  return c.choices[0].message
$$ language plpython3u;
commit;

 * postgresql://localhost/w4111
Done.
Done.
Done.

Empty DataFrame
Columns: []
Index: []

In [56]:
%sql select llm('cherries are yummy')

 * postgresql://localhost/w4111
(psycopg2.errors.ExternalRoutineException) openai.APIConnectionError: Connection error.
CONTEXT:  Traceback (most recent call last):
  PL/Python function "llm", line 9, in <module>
    c = client.chat.completions.create(
  PL/Python function "llm", line 274, in wrapper
  PL/Python function "llm", line 828, in create
  PL/Python function "llm", line 1279, in post
  PL/Python function "llm", line 956, in request
  PL/Python function "llm", line 1016, in _request
  PL/Python function "llm", line 1094, in _retry_request
  PL/Python function "llm", line 1016, in _request
  PL/Python function "llm", line 1094, in _retry_request
  PL/Python function "llm", line 1026, in _request
PL/Python function "llm"

[SQL: select llm('cherries are yummy')]
(Background on this error at: https://sqlalche.me/e/20/2j85)